/*
 * STRICTLY CONFIDENTIAL
 * TRADE SECRET
 * PROPRIETARY:
 *       "Intelinvest" Ltd, TIN 1655386205
 *       420107, REPUBLIC OF TATARSTAN, KAZAN CITY, SPARTAKOVSKAYA STREET, HOUSE 2, ROOM 119
 * (c) "Intelinvest" Ltd, 2020
 *
 * СТРОГО КОНФИДЕНЦИАЛЬНО
 * КОММЕРЧЕСКАЯ ТАЙНА
 * СОБСТВЕННИК:
 *       ООО "Интеллектуальные инвестиции", ИНН 1655386205
 *       420107, РЕСПУБЛИКА ТАТАРСТАН, ГОРОД КАЗАНЬ, УЛИЦА СПАРТАКОВСКАЯ, ДОМ 2, ПОМЕЩЕНИЕ 119
 * (c) ООО "Интеллектуальные инвестиции", 2020
 */

import {MapType} from "./types";

export const COUNTRY_BY_CODE: MapType = {
    US: "США",
    RU: "Россия",
    IN: "Индия",
    CA: "Канада",
    IE: "Ирландия",
    GB: "Великобритания",
    BM: "Бермуды",
    DE: "Германия",
    KY: "Каймановые острова",
    IL: "Израиль",
    MH: "Маршалловы острова",
    LU: "Люксембург",
    NL: "Нидерланды",
    VG: "Виргинские о-ва, Британия",
    FR: "Франция",
    CH: "Швейцария",
    JE: "Остров Джерси",
    IT: "Италия",
    ES: "Испания",
    FI: "Финляндия",
    BE: "Бельгия",
    JP: "Япония",
    PR: "Пуэрто Рико",
    SG: "Сингапур",
    AT: "Австрия",
    AU: "Австралия",
    GG: "Гернси",
    PA: "Панама",
    SE: "Швеция",
    EE: "Эстония",
    PT: "Португалия",
    BS: "Багамы",
    MU: "Остров Маврикий",
    AE: "ОАЭ",
    AG: "Антигуа и Барбуда",
    GM: "Гамбия",
    HK: "Гонконг",
    IM: "Остров Мэн",
    KZ: "Казахстан",
    LR: "Либерия",
    NE: "Нигер",
    NZ: "Новая Зеландия",
    SV: "Сальвадор",
    VI: "Виргинские острова",
};
